---
title: "Jak GUI ovlivňuje."
date: 2005-09-08T19:44:00Z
tags:
  - Uncategorized
redirect_from: /id/6557
category: none
layout: post
---
<p>Zaj&#237;mav&#253; nadpis že?. ;)</p>
<p>Je až s podivem, jak v&#253;sledn&#233; GUI někter&#253;ch programů ovlivňuje na&#353;e my&#353;len&#237; a orientaci a vůbec celou pr&#225;ci s programem. Dva dny před jsem se rozhodl nainstalovat nov&#253; program (z&#225;měrně vynech&#225;m typ př&#237;padně n&#225;zev). Původn&#237; program mi na 98% vyhovoval, ov&#353;em měl několik much, kter&#233; zpomalovaly moji pr&#225;ci (pracuji s n&#237;m již asi 5 let). Nov&#253; program jsem nainstaloval a v&#353;echny nedostatky, kter&#233; mě u původn&#237;ho programu t&#237;žily nebyly. Na&#353;lo se sice několik jin&#253;ch, ale vadily m&#233;ně, neměly takov&#253; dopad na pr&#225;ci. Po nastaven&#237; a pochopen&#237; někter&#253;ch specifick&#253;ch vlastnost&#237;, jsem jej začal použ&#237;vat. Av&#353;ak večer jsem ho celkem n&#225;hle odinstaloval. Ač se mi pr&#225;ce s n&#237;m l&#237;bila, velice &#353;patně jsem se orientoval, což byla nutn&#225; vlastnost pro pohodlnou pr&#225;ci. Toto jsem pr&#225;vě zjistil, d&#237;ky tomu, že během večera již v&#353;e fungovalo a nesoustředil jsem se na přem&#253;&#353;len&#237; o nastaven&#237;, atp., kter&#233; celkově brzdilo pr&#225;ci. No což, rychle jsem ho odinstaloval, neboť mě to celkem rozhodilo. Dnes - dva dny pot&#233; - ulehla mlha &#353;&#237;lenstv&#237; a j&#225; zjistil, že pr&#225;ce s nov&#253;m byla opravdu super a že to budu muset překousnout a zvyknout si (opravdu někter&#233; fce, prov&#225;děn&#233; v threadech (=nebrzd&#237;c&#237; pr&#225;ci) byly l&#225;zn&#237; pro ducha). Měl jsem je&#353;tě několik probl&#233;mů s figurkami a tak jsem pro jistotu je&#353;tě hledal na Internetu (různ&#225; ručn&#237; nastaven&#237; př&#237;mo v konfigur&#225;ku), než se d&#225;m znova do pr&#225;ce. N&#225;hodou se mi podařilo naj&#237;t skin pro tento program, kter&#253; věrně simuloval původn&#237;. Podle obr&#225;zku to vypadalo opravdu super. Nainstaloval jsem tedy program znovu a nasucho aplikoval skin. Wow. Bylo to super. 90% věc&#237; <strong>vypadalo</strong> stejně. V&#353;e jsem tedy znova "naladil". Nyn&#237; ho již použ&#237;v&#225;m cel&#253; den a orientuji se skvěle, pr&#225;ce mi jde od ruky, no zkr&#225;tka par&#225;da.</p>
<p>S&#225;m jsem nemohl uveřit tomu, že jen změna barev a p&#225;r pozic (minimum, hlavně barvy) uděl&#225; tolik. Zvyk je holt železn&#225; ko&#353;ile a nic s t&#237;m člověk nenaděl&#225;.</p>
<p>Poučen&#237; pro př&#237;&#353;tě - makat poř&#225;dně na GUI (i když to mnoh&#233; z n&#225;s nebav&#237;).</p>
<p>PS: Podělte se o sv&#233; z&#225;žitky/postřehy s GUI.</p>