---
title: "Jak jsem jednou referencoval na Firebirdu"
date: 2005-09-28T20:27:00Z
tags:
  - Uncategorized
redirect_from: /id/6637/
category: none
layout: post
---
<p>Byl kr&#225;sn&#253; z&#225;řijov&#253; den a j&#225; se večer rozhodl přepsat svůj model DB do SQL skriptu a vyzkou&#353;et. Nebylo to nic těžk&#233;ho, měl jsem to pěkně namalovan&#233;, takže jsem byl za hodinku hotov. Po přezkoum&#225;n&#237; v&#353;ech vztahů a "znovuzamy&#353;len&#237;se" nad jejich smysluplnost&#237; jsem nechal skript přechroustat Firebird. Raz, dva a bylo hotovo. Hnedle jsem tam "insertnul" testovac&#237; ř&#225;dky a jedem. V&#353;e vypadalo OK, no je&#353;tě zkus&#237;m přid&#225;v&#225;n&#237; loginu př&#237;mo z k&#243;du. Hups a je tam, bez probl&#233;mu. Skvěl&#233;, ř&#237;k&#225;m si, tak ty blbiny smažu a zase někdy (až bude čas) se na to pod&#237;v&#225;m (neb je to moje soukrom&#225; hračka :-)). Chci smazat login kter&#253; jsem vytořil a hle, nejde. Firebird poř&#225;d mele o probl&#233;mu s konverz&#237; stringu na jin&#253; datov&#253; typ. Hled&#225;m, hled&#225;m a nic (a ř&#237;k&#225;m si, že ten FB je ale blbec). Nejprve zkou&#353;&#237;m zru&#353;it vazby u "jasn&#253;ch" tabulek. Poř&#225;d nejde. Hmm, že by k&#243;d vložil něco &#353;patně a "rozbil" DB, zd&#225; se mi to nemožn&#233;. No nic, spou&#353;t&#237;m GFIX, a nic, v&#353;e je OK. Zač&#237;n&#225;m lehce &#353;&#237;let. Pracuji d&#225;l, systematicky hled&#225;m chybu. Po několika nesystematick&#253;ch :-) dropech v&#353;eho co &#353;lo mě to napad&#225;. Metoda min-max. Zač&#237;n&#225;m pomalu odstraňovat objekty v DB. A hle jednu tabulku jsem sm&#225;zl a už to jde. Hmm, koukneme, kde je probl&#233;m. Ano! Jedna z tabulek při tvorbě měla zadefinov&#225;n typ integer, ov&#353;em nadřazen&#225; tabulka byla varchar(12). Opravit. Tak a je to. Je&#353;tě rychle v mozku prol&#233;tnu SQL skript, jestli tam nen&#237; takov&#225;to chyba je&#353;tě někde (vznikla při vytv&#225;řen&#237; struktury a přid&#225;v&#225;n&#237; implementačn&#237;ch věc&#237;, jako např. uměl&#233; id pro PK, atp.). Ne nic tam nen&#237; (snad). OK, pro jistotu je&#353;te uděl&#225;m pro login vlastn&#237; dom&#233;nu, aby se to n&#225;hodou při nějak&#233;m roz&#353;iřov&#225;n&#237; nestalo. Done.</p>
<p>Bye.</p>