---
title: "Víte co je to \"vytvářeč\"?"
date: 2006-02-18T17:13:00Z
tags:
  - .NET
category: none
layout: post
---
<p>Nev&#237;te? Nic si z toho nedělejte, ja to taky nevěděl. Vezmu to trochu ob&#353;&#237;rněji. Během sv&#233;ho z&#225;chvatu po koupi knihy a sebevzděl&#225;v&#225;n&#237; jsem zakoupil knihu <strong>C# - programov&#225;n&#237; datab&#225;z&#237; (Jason Price)</strong> (a asi 5 t&#253;dnů ležela na stole). K t&#233;to knize nap&#237;&#353;u jen několik slov, neb v&#237;ce si nezaslouž&#237;. </p><p>Za prvn&#233;, ja stra&#353;n&#225;. Hromada "vaty", nepřesnost&#237; a celkove hrozn&#253; překlad.</p><p>Jak asi tu&#353;&#237;te (nebo ne) "vytv&#225;řeč" je prostě a jednodu&#353;e konstruktor. Nech&#225;pu, přoč tak zběhl&#253; pojem se někdo snažil ohnout do če&#353;tiny.</p><p>Když už jsem knihu koupil, tak ji přelousk&#225;m, ale nemysl&#237;m, že to byla dobr&#225; investice (např&#237;klad <em>Jeffrey Richter - .NET framework programov&#225;n&#237; aplikac&#237;</em>, to je jin&#225; liga). Rozhodně ji nikomu <strong>nedoporučuji</strong>.</p><p>A teď je p&#225;r slov k chyb&#225;m. Překladu jsme se už zasm&#225;li, takže:<br /><em>ad vata&gt;</em> asi tak prvn&#237; až čtvrt&#225; kapitola se zab&#253;v&#225; v&#237;cem&#233;ně VS a MS SQL Serverem. Prvn&#237; věc považuju za zbytečnou, druhou taky - autor se totiž zameřil na v&#353;echny možn&#233; "klikac&#237;" n&#225;stroje a kde jak jak&#253; select naklikat, ale vlastn&#237;mu SQL vůbec (a to považuji za důležitěj&#353;&#237; než "MS SQL specific" n&#225;stroje a věci, to si můžete kdyžtak nastudovat jinde).<br /><em>ad chyby&gt;</em> tady asi bude stačit jeden za v&#353;echny: "Existuj&#237; tři tř&#237;dy Command: ...". Autor evidentně nepřekročil toolbox VS event. MS SQL Server.</p><p>Ale co, aspoň se pobav&#237;m. :) <br />A kdyby mi kniha dala deset nov&#253;ch znalost&#237;, je to dobře <font size=1>(nyn&#237; (v půlce - jde to rychle, je tam fakt dost vaty), 1 nov&#225; věc)</font>.</p>
