---
title: "Navigace v kódu"
date: 2006-06-08T20:46:00Z
tags:
  - Visual Studio
redirect_from: /id/8358
category: none
layout: post
---
<p>Jak již (mysl&#237;m) někdo tady psal <font size=2>(chtěl jsem naj&#237;t link, ale nepovedlo se, už je někde moc vzadu)</font> tak poměrně silně zabržduje Visual Studio ta li&#353;ta s ComboBoxem, kde jsou vidět metody a je možn&#233; na ně jednodu&#353;e "skočit". Protože děl&#225;m hodně na notebooku, kter&#253; nen&#237; nejnověj&#353;&#237;, je každ&#233; procento v&#253;konu zn&#225;t a tak jsem tuto věcičku podle odkazovan&#233;ho n&#225;vodu vypnul. Rychlost pohybu kurzoru v k&#243;du opravdu citelně vzrostla, ale měl jsem divn&#253; pocit, že nemůže nějak rychle sk&#225;kat v k&#243;du a tak jsem hledal něco co by toto nahradilo (zap&#237;n&#225;n&#237; a vyp&#237;n&#225;n&#237; t&#233; li&#353;ty se mi nezd&#225;lo dobr&#233;). V Delphi existovat expert (z GExperts) kter&#253; umožnovat inkrement&#225;lně vyhledat v seznamu metod a pak se event. na ni přesunout. Hledal jsem něco podobn&#233;ho, ale marně (a dal&#353;&#237; add-iny se mi instalovat nechce).<br />Na&#353;el jsem ale inkrement&#225;ln&#237; hled&#225;n&#237; (nev&#237;m jak moc jej použ&#237;v&#225;te) pod Ctrl[+Shift]+I (std. v C#) a chv&#237;li jsem si zvykal (dr&#237;ve jsem jej použ&#237;val jen občas). Nyn&#237; ale dok&#225;žu d&#237;ky tomuto velmi rychle v k&#243;du sk&#225;kat kam zrovna potřebuju (a když si vybav&#237;te něco co je v t&#233; metodě jedinečn&#233;, jde to rychle).<br />Rozhodně mi li&#353;ta nyn&#237; nechyb&#237; a d&#237;ky Ctrl+I můžu hledat nejen podle n&#225;zvu metod. Pokud na prvn&#237; pokus najdete něco co nechcete a chcete se přesunout na dal&#353;&#237; v&#253;sledek, překvapivě to neuděl&#225;te &#353;ipkou (jak jsem byl zvykl&#253; j&#225;), ale opětovn&#253;m stisknut&#237;m Ctrl[+Shift]+I (&#353;ipka mi připad&#225; přirozeněj&#353;&#237; a Esc na ukončen&#237;). <font size=2>Určitě je to někde napsan&#233;, ale kdo by to hledal, když to můzů objevit empiricky, že? :-)</font></p>
<p>Jak "poskakujete" v k&#243;du vy? M&#225;te sv&#233; f&#237;gly?</p>